cfe llm/InformationRegisters/AI_АгентскиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_АгентскиеОперации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СтатусАгентскойОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДиалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокеныИнструментов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерШага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment/><Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДоступаКДанным</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКорреляции</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдемпотентныйКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючИсточника</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтекста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстJSON</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенВыполнения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АрендаДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОчищены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаДоставки</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСистемногоПромта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксТокеновМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_СтатусАгентскойОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_СтатусАгентскойОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/CommonModules/AI_КонтрактыОпераций/Ext/Module.bsl
Функция ПрочитатьJSONТекст(Текст) Экспорт
	Если СтрДлина(Текст) > 1000000 Тогда
		ВызватьИсключение "Размер JSON превышает 1 МБ символов.";
	КонецЕсли;
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Текст);
	Возврат ПрочитатьJSON(Чтение, Истина);
КонецФункции

Функция ПроверитьСхему(Текст) Экспорт
	Если СтрДлина(Текст) > 100000 Тогда
		ВызватьИсключение "Схема ответа превышает 100000 символов.";
	КонецЕсли;
	Схема = ПрочитатьJSONТекст(Текст);
	ПроверитьУзелСхемы(Схема, 0);
	Если Схема.Получить("type") <> "object" Тогда
		ВызватьИсключение "Корнем схемы ответа должен быть object.";
	КонецЕсли;
	Возврат Схема;
КонецФункции

// Сценарий определяет контракт, но не предоставляет дополнительных прав к агенту.
Функция ПодготовитьПараметры(Исходные) Экспорт
	Параметры = Новый Структура;
	Для Каждого Поле Из Исходные Цикл
		Параметры.Вставить(Поле.Ключ, Поле.Значение);
	КонецЦикла;
	Параметры.Удалить("КодОбработчика");
	Параметры.Удалить("ВерсияКонтракта");
	Параметры.Удалить("СхемаОтветаJSON");
	Сценарий = Неопределено;
	Если Не Параметры.Свойство("Сценарий", Сценарий) Или Не ЗначениеЗаполнено(Сценарий) Тогда
		Возврат Параметры;
	КонецЕсли;
	Если ТипЗнч(Сценарий) <> Тип("СправочникСсылка.AI_Сценарии") Тогда
		ВызватьИсключение "Сценарий должен быть ссылкой справочника сценариев.";
	КонецЕсли;
	Если Сценарий.ПометкаУдаления Или Не Сценарий.Активен Тогда
		ВызватьИсключение "Сценарий недоступен для выполнения.";
	КонецЕсли;
	Если Сценарий.ВерсияКонтракта <= 0 Тогда
		ВызватьИсключение "Укажите положительную версию контракта сценария.";
	КонецЕсли;
	Параметры.Вставить("КодСценария", Сценарий.Код);
	Параметры.Вставить("ВерсияКонтракта", Сценарий.ВерсияКонтракта);
	Параметры.Вставить("СхемаОтветаJSON", Сценарий.СхемаОтветаJSON);
	Параметры.Вставить("КодОбработчика", Сценарий.КодОбработчика);
	Параметры.Вставить("РазрешитьПовтор", Сценарий.РазрешитьПовтор);
	Параметры.Вставить("МаксимумПопыток", Макс(1, Сценарий.МаксимумПопыток));
	Для Каждого Имя Из СтрРазделить("Агент,Провайдер,Модель,ТипAPI", ",") Цикл
		Значение = Неопределено;
		Если Не Параметры.Свойство(Имя, Значение) Или Не ЗначениеЗаполнено(Значение) Тогда
			Параметры.Вставить(Имя, Сценарий[Имя]);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(Сценарий.СхемаОтветаJSON) Тогда
		ПроверитьСхему(Сценарий.СхемаОтветаJSON);
	КонецЕсли;
	Возврат Параметры;
КонецФункции

Процедура ПроверитьУзелСхемы(Схема, Глубина)
	Если Глубина > 16 Или ТипЗнч(Схема) <> Тип("Соответствие") Тогда
		ВызватьИсключение "Недопустимая структура или глубина JSON Schema.";
	КонецЕсли;
	Для Каждого Поле Из Схема Цикл
		Если СтрНайти(",type,properties,required,additionalProperties,items,enum,description,", "," + Поле.Ключ + ",") = 0 Тогда
			ВызватьИсключение "Неподдерживаемое ключевое слово схемы: " + Поле.Ключ;
		КонецЕсли;
	КонецЦикла;
	Тип = Схема.Получить("type");
	Если ТипЗнч(Тип) <> Тип("Строка") Тогда
		ВызватьИсключение "type должен быть строкой.";
	КонецЕсли;
	Для Каждого Поле Из Схема Цикл
		Если (Поле.Ключ = "properties" Или Поле.Ключ = "required" Или Поле.Ключ = "additionalProperties") И Тип <> "object"
			Или Поле.Ключ = "items" И Тип <> "array" Тогда
			ВызватьИсключение "Ключевое слово не соответствует типу схемы: " + Поле.Ключ;
		КонецЕсли;
		Если Поле.Ключ = "description" И ТипЗнч(Поле.Значение) <> Тип("Строка") Тогда
			ВызватьИсключение "description должен быть строкой.";
		КонецЕсли;
		Если Поле.Ключ = "enum" И ТипЗнч(Поле.Значение) <> Тип("Массив") Тогда
			ВызватьИсключение "enum должен быть массивом.";
		КонецЕсли;
	КонецЦикла;
	Если Тип = "object" Тогда
		Свойства = Схема.Получить("properties");
		Обязательные = Схема.Получить("required");
		Если ТипЗнч(Свойства) <> Тип("Соответствие")
			Или ТипЗнч(Обязательные) <> Тип("Массив")
			Или Схема.Получить("additionalProperties") <> Ложь Тогда
			ВызватьИсключение "Для object нужны properties, required и additionalProperties=false.";
		КонецЕсли;
		Если Обязательные.Количество() <> Свойства.Количество() Тогда
			ВызватьИсключение "Строгая схема требует включить все свойства в required.";
		КонецЕсли;
		Для Каждого Свойство Из Свойства Цикл
			Если Обязательные.Найти(Свойство.Ключ) = Неопределено Тогда
				ВызватьИсключение "Свойство отсутствует в required: " + Свойство.Ключ;
			КонецЕсли;
			ПроверитьУзелСхемы(Свойство.Значение, Глубина + 1);
		КонецЦикла;
	ИначеЕсли Тип = "array" Тогда
		ПроверитьУзелСхемы(Схема.Получить("items"), Глубина + 1);
	ИначеЕсли СтрНайти(",string,number,integer,boolean,null,", "," + Тип + ",") = 0 Тогда
		ВызватьИсключение "Неподдерживаемый тип схемы: " + Тип;
	КонецЕсли;
	Варианты = Схема.Получить("enum");
	Если Варианты <> Неопределено Тогда
		Если ТипЗнч(Варианты) <> Тип("Массив") Тогда
			ВызватьИсключение "enum должен быть массивом.";
		КонецЕсли;
		Если Варианты.Количество() = 0 Или Тип = "object" Или Тип = "array" Тогда
			ВызватьИсключение "enum поддерживается только для непустого набора скалярных значений.";
		КонецЕсли;
		БазоваяСхема = Новый Соответствие;
		БазоваяСхема.Вставить("type", Тип);
		Для Каждого Вариант Из Варианты Цикл
			ПроверитьЗначение(Вариант, БазоваяСхема, "$schema.enum", Глубина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ДоставитьРезультат(ИдентификаторОперации) Экспорт
	Если ПривилегированныйРежим() Или ТранзакцияАктивна() Тогда
		ВызватьИсключение "Доставка должна выполняться в отдельном непривилегированном контексте.";
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		Контракт = СлужебнаяЗаписьДоставки(ИдентификаторОперации);
		Если Контракт = Неопределено Тогда
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		Обработан = Ложь;
		AI_ОбработчикиРезультатовПереопределяемый.ОбработатьРезультат(Контракт.КодОбработчика, Контракт, Обработан);
		Если Не Обработан Тогда
			ВызватьИсключение "Код обработчика не зарегистрирован в интеграционном модуле.";
		КонецЕсли;
		СлужебнаяЗаписьДоставки(ИдентификаторОперации, "Доставлен");
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОтменитьТранзакцию();
		НачатьТранзакцию();
		Попытка
			СлужебнаяЗаписьДоставки(ИдентификаторОперации, "Ошибка", ТекстОшибки);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецПопытки;
КонецПроцедуры

Функция СлужебнаяЗаписьДоставки(ИдентификаторОперации, Статус = "", Ошибка = "")
	ИсходныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("РегистрСведений.AI_АгентскиеОперации");
		Элемент.УстановитьЗначение("ИдентификаторОперации", ИдентификаторОперации);
		Блокировка.Заблокировать();
		Запись = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторОперации = ИдентификаторОперации;
		Запись.Прочитать();
		Контракт = Неопределено;
		Если Запись.Выбран()
			И Запись.ИдентификаторПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор
			И Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Завершена
			И Не Запись.ДанныеОчищены И Запись.СтатусДоставки = "Ожидает"
			И ЗначениеЗаполнено(Запись.КодОбработчика) Тогда
			Контракт = Новый Структура;
			Для Каждого Имя Из СтрРазделить("ИдентификаторОперации,ИдентификаторКорреляции,КодСценария,КодОбработчика,ВерсияКонтракта,Источник,ТипИсточника,КлючИсточника,КонтекстJSON,Результат", ",") Цикл
				Контракт.Вставить(Имя, Запись[Имя]);
			КонецЦикла;
			Если ЗначениеЗаполнено(Статус) Тогда
				Запись.СтатусДоставки = Статус;
				Запись.ОшибкаДоставки = Ошибка;
				Запись.Версия = Запись.Версия + 1;
				Запись.Записать();
			КонецЕсли;
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(ИсходныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйРежим);
	Возврат Контракт;
КонецФункции

Процедура ПовторитьДоставку(ИдентификаторОперации) Экспорт
	ИсходныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Попытка
		AI_ДиспетчерОпераций.ЗаблокироватьОчередь();
		Запись = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторОперации = ИдентификаторОперации;
		Запись.Прочитать();
		Если Не Запись.Выбран()
			Или Запись.ИдентификаторПользователя <> ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор Тогда
			ВызватьИсключение "Операция недоступна текущему пользователю.";
		КонецЕсли;
		Если Запись.ДанныеОчищены Или Запись.СтатусДоставки <> "Ошибка"
			Или Запись.Статус <> Перечисления.AI_СтатусАгентскойОперации.Завершена Тогда
			ВызватьИсключение "Повтор доставки недоступен для текущего состояния.";
		КонецЕсли;
		Запись.СтатусДоставки = "Ожидает";
		Запись.ОшибкаДоставки = "";
		Запись.Версия = Запись.Версия + 1;
		Запись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		УстановитьПривилегированныйРежим(ИсходныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйРежим);
	AI_ДиспетчерОпераций.ОбработатьОчередь();
КонецПроцедуры

Функция ПроверитьОтвет(Текст, СхемаJSON) Экспорт
	Схема = ПроверитьСхему(СхемаJSON);
	Данные = ПрочитатьJSONТекст(Текст);
	ПроверитьЗначение(Данные, Схема, "$", 0);
	Возврат Данные;
КонецФункции

Процедура ПроверитьЗначение(Данные, Схема, Путь, Глубина)
	Если Глубина > 16 Тогда
		ВызватьИсключение "Превышена глубина ответа: " + Путь;
	КонецЕсли;
	Тип = Схема.Получить("type");
	Корректно = Ложь;
	Если Тип = "object" Тогда
		Корректно = ТипЗнч(Данные) = Тип("Соответствие");
	ИначеЕсли Тип = "array" Тогда
		Корректно = ТипЗнч(Данные) = Тип("Массив");
	ИначеЕсли Тип = "string" Тогда
		Корректно = ТипЗнч(Данные) = Тип("Строка");
	ИначеЕсли Тип = "number" Или Тип = "integer" Тогда
		Корректно = ТипЗнч(Данные) = Тип("Число");
		Если Корректно И Тип = "integer" Тогда
			Корректно = Данные = Цел(Данные);
		КонецЕсли;
	ИначеЕсли Тип = "boolean" Тогда
		Корректно = ТипЗнч(Данные) = Тип("Булево");
	ИначеЕсли Тип = "null" Тогда
		Корректно = Данные = Неопределено Или ТипЗнч(Данные) = Тип("Null");
	КонецЕсли;
	Если Не Корректно Тогда
		ВызватьИсключение "Ответ не соответствует схеме: " + Путь + ", ожидается " + Тип;
	КонецЕсли;
	Если Тип = "object" Тогда
		Свойства = Схема.Получить("properties");
		Если Данные.Количество() <> Свойства.Количество() Тогда
			ВызватьИсключение "Набор свойств ответа не соответствует схеме: " + Путь;
		КонецЕсли;
		Для Каждого Поле Из Данные Цикл
			Узел = Свойства.Получить(Поле.Ключ);
			Если Узел = Неопределено Тогда
				ВызватьИсключение "Неизвестное свойство ответа: " + Путь + "." + Поле.Ключ;
			КонецЕсли;
			ПроверитьЗначение(Поле.Значение, Узел, Путь + "." + Поле.Ключ, Глубина + 1);
		КонецЦикла;
	ИначеЕсли Тип = "array" Тогда
		Для Каждого Элемент Из Данные Цикл
			ПроверитьЗначение(Элемент, Схема.Получить("items"), Путь + "[]", Глубина + 1);
		КонецЦикла;
	КонецЕсли;
	Варианты = Схема.Получить("enum");
	Если Варианты <> Неопределено И Варианты.Найти(Данные) = Неопределено Тогда
		ВызватьИсключение "Значение не входит в enum: " + Путь;
	КонецЕсли;
КонецПроцедуры
